DPMFoam_TestCase/constant/kinematicCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      particleProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         off;
    transient       yes;
    cellValueSourceCorrection off;

    interpolationSchemes
    {
        rho.air         cell;
        U.air           cellPoint;
        mu.air          cell;
        curlUcDt        cellPoint;
        DUcDt           cellPoint;
    }

    integrationSchemes
    {
        U               Euler;
    }

    sourceTerms
    {
        schemes
        {
            U semiImplicit 1;
        }
    }
}

constantProperties
{
    parcelTypeId 1;

    rhoMin          1e-15;
    minParcelMass   1e-15;

    rho0            1.2;
    youngsModulus   1e8;
    poissonsRatio   0.35;

    constantVolume  false;

    alphaMax        0.99;
}

subModels
{
    particleForces
    {
        ErgunWenYuDrag
        {
            alphac alpha.air;
        }
        SaffmanMeiLiftForce
        {
         U    U.air;
        }
        pressureGradient
        {
         U   U.air;
        }
         gravity;
    }

    injectionModels
    {
        /*model2
        {
            type            patchInjection;
            massTotal       0;
            parcelBasisType fixed;
            patchName       inlet;
            nParticle       1;
            parcelsPerSecond 500;
            SOI            0;
            U0              (-1 0 0);
             sizeDistribution
            {
                 type        normal;
                normalDistribution
                {
                    expectation 6e-6;
                    variance 3e-6;
                    minValue 2e-6;
                    maxValue 10e-6;
                }
            }
            flowRateProfile constant 1;
            massTotal   0;
            duration    80;
        }

         model3
        {
            type            patchInjection;
            massTotal       0;
            parcelBasisType fixed;
            patchName       inlet1;
            nParticle       1;
            parcelsPerSecond  3000;
            SOI            0;
            U0              (0 0 3);
             sizeDistribution
            {
                 type        normal;
                normalDistribution
                {
                    expectation 6e-6;
                    variance 3e-6;
                    minValue 2e-6;
                    maxValue 10e-6;
                }
            }
            flowRateProfile constant 1;
            massTotal   0;
            duration    80;
        }


        model4
        {
            type            patchInjection;
            massTotal       0;
            parcelBasisType fixed;
            patchName       inlet2;
            nParticle       1;
            parcelsPerSecond  500;
            SOI            0;
            U0              (0 0 2);
             sizeDistribution
            {
                 type        normal;
                normalDistribution
                {
                    expectation 6e-6;
                    variance 3e-6;
                    minValue 2e-6;
                    maxValue 10e-6;
                }
            }
            flowRateProfile constant 1;
            massTotal   0;
            duration    80;
        }*/
    }

    dispersionModel stochasticDispersionRAS;

    patchInteractionModel localInteraction;

    localInteractionCoeffs
    {
        patches
        (
            inlet
            {
                type escape;
            }
            outlet
            {
                type escape;
            }
            walls
            {
                type stick;
            }
            frontAndBack
            {
                type escape;
            }
            atmosphere
            {
                type escape;
            }
            buildings
            {
                type stick;
            }
            chimney1
            {
                type stick;
            }
            chimney2
            {
                type stick;
            }
            inlet1
            {
                type stick;
            }
            inlet2
            {
                type stick;
            }
        );
    }

    StandardWallInteractionCoeffs
    {
        type rebound;
        e    0.97;
        mu   0.09;
    }

    heatTransferModel none;

    surfaceFilmModel none;

    collisionModel none;

    pairCollisionCoeffs
    {
        maxInteractionDistance  0.000006;

        writeReferredParticleCloud no;

        pairModel pairSpringSliderDashpot;

        pairSpringSliderDashpotCoeffs
        {
            useEquivalentSize   no;
            alpha               0.02;
            b                   1.5;
            mu                  0.10;
            cohesionEnergyDensity 0;
            collisionResolutionSteps 12;
        };

        wallModel wallSpringSliderDashpot;

        wallSpringSliderDashpotCoeffs
        {
            useEquivalentSize no;
            collisionResolutionSteps 12;
            youngsModulus   1e8;
            poissonsRatio   0.23;
            alpha           0.01;
            b               1.5;
            mu              0.09;
            cohesionEnergyDensity 0;
        };

        UName U.air;
    }

    stochasticCollisionModel none;

    radiation off;
}


cloudFunctions
{}

