DPMFoam_TestCase/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

buildings.obj
{
    #includeEtc "caseDicts/surface/surfaceFeatureExtractDict.cfg"
}
chimney1.stl
{
    extractionMethod     extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle    150;
    }

    subsetFeatures
    {
        nonManifoldEdges yes;
        openEdges        yes;
    }

    trimFeatures
    {
        minElem          0;
        minLen           0;
    }

    writeObj             yes;
}

chimney2.stl
{
    extractionMethod     extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle    150;
    }

    subsetFeatures
    {
        nonManifoldEdges yes;
        openEdges        yes;
    }

    trimFeatures
    {
        minElem          0;
        minLen           0;
    }

    writeObj             yes;
}





// ************************************************************************* //
