DPMFoam_TestCase/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    //颗粒入射体积源
    {
        name    injectionCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
           box (-20 -50 0) (330 230 140);
        }
    }
    {
        name    injection;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set injectionCellSet;
        }
    }

  //chimney2

    {
        name    f1;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
          box (158.999 18.999 9.99)(161.001 21.001 10.01);
        }
    }
      //chimney1
     {
        name    f0;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (276.9 116.9 79.99)(283.1 123.1 80.01);
        }
    }
);

// ************************************************************************* //
